# -*- coding: UTF-8 -*-

content = """《国王游戏》是神作还是粪作？男主是博爱还是渣男？
正所谓一千个人眼里就有一千个哈姆雷特，由于每个人的审美和价值观都是不一样的，就导致没办法整体去评判一部作品的好坏，不过总会有那么一两部作品，得到了大家的一致吐槽，就比如《国王游戏》。《国王游戏》本身就是给特定的群体去看的，但最终传达出来的信息却是打脸行为，导致大家觉得非常反感，那么《国王游戏》这部漫画究竟有多少槽点呢？
剧情介绍
《国王游戏》的男主是一名普通的高中生，这一天，他转学去了乡村中学，但是自从男主来到新班级之后，同学们就被男主的一些怪异的举动给吸引了，就当同学们都好奇男主的身份背景时，突然收到了国王游戏的手机短信，短信中要求每个人都必须按照短信内容行事，不然就会死亡，但这只是一条短信，所以有些人根本就没有放在心上，等到夜幕降临之时，就有同学因为没有完成短信里的命令而离奇死亡了。
这时，男主便将还活着的同学都召集了起来，表示自己曾经参加过这个游戏，紧接着，就开始回忆起男主在转学之前的故事。原来男主原来所在班级的同学就是因为国王游戏接连死亡的，在这个过程中，男主为了救好朋友，居然不惜亲手给自己戴了绿帽，而男主的女朋友最终也因为想要救男主选择了自杀，就这样男主成为了国王游戏最后的获胜者。
但是男主现在所在班级的同学听了男主的遭遇之后不仅不想办法共同对抗国王游戏，反而还斥责男主，而且女主还黑化了，并组织同学共同排挤男主，不过好在还有两个同学有仅存的理念，并没有和女主为伍，然而这两人很快就因为国王游戏接连死去了。其实女主之所以排挤男主，其根本原因就是因为女主曾经也是这个游戏的获胜者，所以她当然不允许男主的存在了，好在同学们最终都看清了女主的真面目。
最后在众人的帮助之下，男主终于将死去同学们手机里的讯息都拼成了暗码，就当大家以为可以终结国王游戏之时，得到的却是晴天霹雳，原来要想结束这场游戏，那么所有参加过游戏的人都必须得死，女主为了独活，打算掐死男主，就在这关键时刻，一直爱慕男主的大小姐用电锯锯死了女主，但女主压根就没有死透，又砍死了男主，最后大小姐为了能够终结国王游戏，带着男主的尸体一起殉情了。
主题：人性
其实这部作品的主题就是人性，所以便用女主不断地黑化来衬托男主的勇于反抗，甚至后期还暗示周围的人都被男主的这种人性的光辉给感染了，就连之前看男主不爽的大小姐也情不自禁地爱上了男主，至于最后团灭的大结局也只不过是想要再度升华男主的人格魅力罢了。
但在我看来，这个主题完全是不合逻辑的，要知道人在绝境之时，本能就是想要活下去，所以在这种时候展现出人性的丑陋本身就是不合理的，而且观众也没有办法共情。
而且更可笑的是，其中还表明国王游戏中藏有病毒，这种病毒会对人进行心理暗示，从而导致同学们的接连死亡。看到这里，也不的不说，这编剧是真的当所有观众的脑袋都被国王游戏控制住了吗？究竟是什么病毒才能让人直接精神失常，而且只听说病毒能够让电脑速度缓慢的，从来就不知道病毒还能对人心理暗示，而且为什么一条短信就成为了传播病毒的载体呢？一般的病毒要么是通过呼吸道，要么是被人吃进了肚子里，短信这虚无缥缈的东西，怎么就能将病毒传播给人类呢，也是奇了怪了。
男主本身就是渣男的存在
咱们再回到男主身上，这部动漫无非就是想要将男主塑造成一个博爱之人，以此来达到将爱传递给他人的效果，但实话实说，这男主身上一丁点博爱的性质都没有。就比如，男主为了救自己的基友，就把女朋友和基友关在了一起，让他们深入交流来化解基友的危机。是不是还有人觉得男主这么做挺无私、挺博爱的，连自己的女朋友都舍出去了，但在我看来，这分明就是渣男行为。
怎么说也是自己的女朋友，在做决定之前问都不问，就直接强制性地将女朋友和基友关到了一起，虽然你是在救人，但好歹是别人要做出牺牲，怎么着也先经过他人的允许吧，而且还是接连两次。
更为过分的是，途中基友曾经反抗过，但男主居然打晕了基友，然后让女朋友接着上，兄弟，这真的是你的女朋友吗？要不是前面的剧情，我还真以为这是你为了救基友，随便找的一个同班同学呢。而且基友都已经明确拒绝了，男主还是坚持让女朋友和基友啪啪啪，你又不是对方的父母，难道还要上演我这么做都是为了你好的戏码嘛，完事之后，基友是不是还得向你道谢啊。
结语
正所谓，神作与粪作只有一纸之隔，可惜的是，《国王游戏》明显是属于后者，想要表现出人性的光辉，但男主的行为又啪啪打脸，根本就没有考虑到女朋友和基友的意愿，完全就是想着怎么突显自己的舍己救人，怎么伟大，实则渣透了，也烂透了。"""

import re
cjkReg = re.compile(u'[\u1100-\uFFFDh]+?')
trimedCJK = cjkReg.sub(' a ', content, 0) # replace the CJK with the word a
print(len(trimedCJK.split()))